---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures
source: html/13d33852-f996-21d4-3d9b-f37c90785120.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures

Failures about Schedule.

## Syntax (C#)
```csharp
public static class ScheduleViewFailures
```